app/controllers/dealer_stores_controller.rb

SELECT "dealer_stores".* FROM "dealer_stores"
---
  def index
    @dealer_stores = DealerStore.all

INSERT INTO "dealer_stores" ("branch_name", "adress", "dealer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @dealer_store = DealerStore.new(dealer_store_params)

    if @dealer_store.save