app/controllers/dealers_controller.rb

  def index
    @dealers = Dealer.all
---
SELECT "dealers".* FROM "dealers"

  def create
    @dealer = Dealer.new(dealer_params)

    if @dealer.save
---
INSERT INTO "dealers" ("dealer_name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["dealer_name", "HANNAH"], ["description", "asldkjlajdkas"], ["created_at", "2015-03-17 14:09:32.471979"], ["updated_at", "2015-03-17 14:09:32.471979"]]