app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    if @product.save
---
INSERT INTO "products" ("SKU", "name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["SKU", "98174298347982"], ["name", "washing machine"], ["description", "sdlkfjlkaf"], ["created_at", "2015-03-16 08:53:05.068722"], ["updated_at", "2015-03-16 08:53:05.068722"]]