app/controllers/product_prices_controller.rb

  def index
    @product_prices = ProductPrice.all
---
SELECT "product_prices".* FROM "product_prices"

  def create
    @product_price = ProductPrice.new(product_price_params)

    if @product_price.save
---
INSERT INTO "product_prices" ("dealer_store_id", "product_id", "price", "effective_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["dealer_store_id", 1], ["product_id", 3], ["price", 65.0], ["effective_date", "2015-03-17"], ["created_at", "2015-03-17 14:42:58.413875"], ["updated_at", "2015-03-17 14:42:58.413875"]]