app/controllers/sales_controller.rb

  def index
    @sales = Sale.all
---
SELECT "sales".* FROM "sales"

  def show
    @sale = Sale.find(params[:id])
---
SELECT  "sales".* FROM "sales" WHERE "sales"."id" = ? LIMIT 1  [["id", 0]]

  def create
    @sale = Sale.new(sale_params)

    if @sale.save
---
INSERT INTO "sales" ("serial_number", "invoice_number", "mode_of_payment", "mode_of_delivery", "request_for_installation", "invoice_amount", "incentive", "product_id", "date_of_purchase", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
    @sale = Sale.find(params[:id])
    @sale.destroy!
---
SELECT  "sales".* FROM "sales" WHERE "sales"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "sales" WHERE "sales"."id" = ?  [["id", 1]]